[
  {
    "id": "v2.3.0",
    "version": "2.3.0",
    "date": "September 7, 2025 - September 13, 2025",
    "type": "feature",
    "title": "Bug Fixes and Improvements",
    "description": "This release includes 1 improvements and 1 bug fixes.",
    "features": [
      {
        "title": "Fixed customerId params error",
        "description": "Fixed customerId params error."
      }
    ]
  },
  {
    "id": "v2.2.0",
    "version": "2.2.0",
    "date": "September 14, 2025 - September 20, 2025",
    "type": "major",
    "title": "Add customer sharing retrieval API and enhance user management with external user support and More",
    "description": "This release includes 32 improvements with 5 new features and 3 bug fixes.",
    "features": [
      {
        "title": "Add customer sharing retrieval API and enhance user management with external user support",
        "description": "Added add customer sharing retrieval API and enhance user management with external user support."
      },
      {
        "title": "Enhance error handling and connection pooling in MongoDB connection [test]",
        "description": "Added enhance error handling and connection pooling in MongoDB connection [test]."
      },
      {
        "title": "Enhanced mongodb connection handling with retry logic and caching",
        "description": "Added enhanced mongodb connection handling with retry logic and caching."
      },
      {
        "title": "Updated campaign model properties",
        "description": "Added updated campaign model properties."
      },
      {
        "title": "Update campaign handling for \"Always On\" type",
        "description": "Added update campaign handling for \"Always On\" type; adjust required fields and date handling."
      },
      {
        "title": "Re-rolled back to old db connection",
        "description": "Fixed an issue where re-rolled back to old db connection."
      },
      {
        "title": "Vercel connection & middleware issues",
        "description": "Fixed an issue where vercel connection & middleware issues."
      },
      {
        "title": "Vercel connection & middleware issues",
        "description": "Fixed an issue where vercel connection & middleware issues."
      },
      {
        "title": "Replace API call with direct database query for static expenses",
        "description": "Refactored replace API call with direct database query for static expenses for improved performance and maintainability."
      },
      {
        "title": "Update campaign status options and default values across components",
        "description": "Refactored update campaign status options and default values across components for improved performance and maintainability."
      }
    ]
  },
  {
    "id": "v2.1.0",
    "version": "2.1.0",
    "date": "September 21, 2025 - September 27, 2025",
    "type": "major",
    "title": "Enhanced login flow with improved redirect handling and error management and More",
    "description": "This release includes 29 improvements with 5 new features and 3 bug fixes.",
    "features": [
      {
        "title": "Enhanced login flow with improved redirect handling and error management",
        "description": "Added enhanced login flow with improved redirect handling and error management."
      },
      {
        "title": "Added session maxAge configuration and secure cookie headers in auth and next config",
        "description": "Added added session maxAge configuration and secure cookie headers in auth and next config."
      },
      {
        "title": "Enhance redirect logic for login and middleware to handle session state more effectively",
        "description": "Added enhance redirect logic for login and middleware to handle session state more effectively."
      },
      {
        "title": "Add user creation functionality with modal and validation",
        "description": "Add user creation functionality with modal and validation."
      },
      {
        "title": "Enhance customer sharing functionality with user validation and error handling",
        "description": "Enhance customer sharing functionality with user validation and error handling."
      },
      {
        "title": "Refine middleware to skip additional API routes and remove unnecessary matcher path",
        "description": "Fixed an issue where refine middleware to skip additional API routes and remove unnecessary matcher path."
      },
      {
        "title": "Update API endpoints in StaticExpenses component to use versioned routes for fetching and saving static expenses",
        "description": "Fixed an issue where update API endpoints in StaticExpenses component to use versioned routes for fetching and saving static expenses."
      },
      {
        "title": "Replace NextResponse with Response for consistent JSON handling in static expenses API",
        "description": "Fixed an issue where replace NextResponse with Response for consistent JSON handling in static expenses API."
      },
      {
        "title": "Replace Geist font with Fustat and update layout styling",
        "description": "Refactored replace Geist font with Fustat and update layout styling for improved performance and maintainability."
      }
    ]
  },
  {
    "id": "v2.0.0",
    "version": "2.0.0",
    "date": "September 28, 2025 - October 4, 2025",
    "type": "major",
    "title": "Update PPC Dashboard to enhance campaign data display with search functionality and increase campaign limit to 1000 and More",
    "description": "This release includes 13 improvements with 5 new features and 1 bug fixes.",
    "features": [
      {
        "title": "Update PPC Dashboard to enhance campaign data display with search functionality and increase campaign limit to 1000",
        "description": "Update PPC Dashboard to enhance campaign data display with search functionality and increase campaign limit to 1000."
      },
      {
        "title": "Add currency selection and update functionality in customer settings",
        "description": "Add currency selection and update functionality in customer settings."
      },
      {
        "title": "Update ProfileAccordionTab to accept default active tab from URL",
        "description": "Added Update ProfileAccordionTab to accept default active tab from URL."
      },
      {
        "title": "Refactor DashboardCharts component",
        "description": "Added refactor DashboardCharts component; streamline chart data setup and enhance comparison data handling for revenue, AOV, and spend allocation charts."
      },
      {
        "title": "Implement customer settings management with metric preference updates and API integration",
        "description": "Added implement customer settings management with metric preference updates and API integration."
      },
      {
        "title": "Small gtm init error",
        "description": "Fixed an issue where small gtm init error."
      },
      {
        "title": "Campaign fetching and updating logic in CampaignList component",
        "description": "Refactored campaign fetching and updating logic in CampaignList component; enhance organization and filtering of campaigns for improved performance and maintainability."
      },
      {
        "title": "Add and refactor performance dashboard components for metrics and charts + updated charts with YTD option",
        "description": "Add and refactor performance dashboard components for metrics and charts + updated charts with YTD option."
      }
    ]
  }
]